---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecCurrent
source: html/f9a807ad-616c-539a-4496-1b024fb91515.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecCurrent Property

"Current"

## Syntax (C#)
```csharp
public static ForgeTypeId MepAnalyticalElecCurrent { get; }
```